app/controllers/folder_controller.rb

  def list
    # Get the folder
    #folder_id = 1
    @folder = Folder.find_by_id(folder_id)
---
SELECT * FROM `folders` WHERE (`folders`.parent_id = 1) ORDER BY name, name