app/controllers/search_controller.rb

SELECT * FROM `myfiles` WHERE (filename like '%%')
---
  def show_results
    if request.post?
      @search_query = params[:search][:query]
      @search_type = params[:search_type]
      @result = [] # array to hold the results
      if  @search_type == "content" # search file content, using ferret
        # Search with Ferret in both Folder (name)
        # and Myfile (filename and text)
        Folder.multi_search(@search_query, [Myfile]).each do |hit|
          if hit.class == Folder
            @result << hit if @logged_in_user.can_read(hit.id)
          elsif hit.class == Myfile
            @result << hit if @logged_in_user.can_read(hit.folder.id)
          end
        end
      elsif @search_type == "filename" # Added to BXR: search only filename, no ferret used
        @result = Myfile.find(:all, :conditions => ["filename like ?", "%#{@search_query}%"])