app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def list
    @users = User.find(:all, :order => 'name')

INSERT INTO `users` (`name`, `is_the_administrator`, `default_folder_id`, `hashed_password`, `password_salt`, `rss_access_key`, `email`) VALUES('sedrtf', 0, 1, 'f542bc217ef4b810b1b580ef1c2270e6a66cfc51', 'D5BbpW', 'MuOtt3CsOFB40yLWfU6wIyoJApQH0UPj2Pc6', 'admin@gmail.com')
---
  def create
    if request.post?
      @user = User.new(params[:user])
      @user.password_required = true

      # add the user to the selected groups
      add_user_to_groups(@user, params[:belongs_to_group])
      @user.default_folder_id = params[:user][:default_folder_id].to_i
      if @user.save